[
  {
    "start_date": "2017-11-23",
    "short_description": "I Noug Dug ska du som spelare rädda mänskligheten från de monster som har invaderat planeten. Dem befinner sig underjord och med dina favorit nougatkakor eliminerar du dessa för att samla så hög poäng som möjligt. Spelet är inspirerat av det gamla arkadspelet Dig Dug från år 1982 och den populära Netflix TV-serien Stranger Things.",
    "course_name": "Projekt: Objektorienterat system",
    "long_description": "<b>Vad är Noug Dug?</b><p>I Noug Dug ska du som spelare rädda mänskligheten från de monster som har invaderat planeten. Dem befinner sig underjord och med dina favorit nougatkakor eliminerar du dessa för att samla så hög poäng som möjligt. Det gör du antingen genom att övergöda monstren tills de spricker eller gräva under stenar så de faller och krossar dem.</p><p> Spelet är inspirerat av det gamla arkadspelet Dig Dug från år 1982 och den populära Netflix TV-serien Stranger Things. Du är mänsklighetens enda hopp att tvinga tillbaka varelserna till Upp-och-ner dimensionen kan du rädda oss?</p><p> Låter toppen! Ge mig mer detaljer! Noug Dug är ett 2-dimensionellt ruggigt kul äventyrsmanande charmigt spel. Där du som spelare är en karaktär från Stranger Things och gräver dig runt för att hitta monstren. </p><p>Du börjar i mitten av spelplanen under jord. Gräv tunnlar genom att gå runt på spelplanen och se upp för Demogorgons och Demodogs som jagar dig om de upptäcker dig. Om de får tag i dig, eller om du blir träffad av en Demogorgons slem förlorar du ett liv. Varelserna kan gå igenom jorden och stenar. Distrahera varelserna genom att kasta ut nougatkakor och gå förbi dem.</p><p>Det är inte bara monster man måste se upp för. Du gräver dig genom outforskad mark och måste akta dig när du gräver tunnlar under stenar som faller efter ett tag och kan mosa dig.</p><p>Under jorden finns det rötter som du kan gräva fram. Rötterna försöker försvara sitt näste och fångar dig. Förhoppningsvis kan du slå dig ur dessa innan monstren får tag på dig.</p><p>Utmana dig själv genom att samla den högsta poängen. Det gör du genom att samla mer poäng ju längre ner i jorden du eliminerar varelserna. Besegrar du Demogorgons i ett horisontellt plan får du extra poäng men se upp för slemmet de skjuter ut framför sig! Det högsta poängen får du genom att mosa monstren med de fallande stenarna. Ju längre stenen faller innan den mosar monstret desto mer poäng får man. De fyra olika poängnivåerna kan man se på jordens färg. Om du spräcker ett monster längre ner i jorden får du mer poäng. </p><p>Även fast det ser mörkt ut så klarar du det. Du hade modet att gräva dig under jord för att leta efter monster från en annan dimension. Då har du modet att eliminera dem. Ett snabbt hundliknande monster som öppnar upp sitt ansikte? Inga problem! Demogorgon som törstar efter ditt blod? Kom an bara!</p>",
    "group_size": 2,
    "academic_credits": "6",
    "lulz_had": "many",
    "external_link": "https://gitlab.ida.liu.se/seblu114/NougDug",
    "small_image": "noug.png",
    "techniques_used": [
      "C++",
      "SFML",
      "Clion",
      "Git"
    ],
    "project_name": "python data-module test script",
    "course_id": "TDP005",
    "end_date": "2017-11-21",
    "project_id": 1,
    "big_image": "noug2.png"
  }
]
